public class DoubleLesson {
    public static void main(String[] args) {
        //целые числа
        byte a; //1 байт -> -128 до 127
        short b; //2 байта -> -32000 до 32000
        int rabbits = 5; //4 байта -> -2 млрд. до 2 млрд.
        long time = 456_456_456_456L; //8 байт -> очень много

        //дробные числа
        float firstNumber; //4 байта
        double secondNumber; //8 байт

        //Вася получает зарплату в 5.6 евро в час. Он работает 12 часов в день,
        // у него нет выходных, кроме 31 декабря. Он работает 364 дня в году.
        //Сколько часов отработает Вася за год и сколько он заработает денег.

        //Ему дали отпуск в течение двух недель, он оплачивается в 50% от зп,
        // пересчитайте зарплату за год


        //20-30 -> 20-45 - перерыв

        //символный тип данных
        char s; //2 байта 0-65535

        char symbol = 'a' + 400;

        System.out.println(symbol);



        //логический тип данных











        //5.2 * 2 = 10.4
        //5.2 * 2 = 10.39998

        //double number = 1; //1.0
        //int n = 1;
//
        //System.out.println(number / 2); //не-целое деление (честное) 2.5
        //System.out.println(n / 2); //целочисленное деление 2
//
        //System.out.println(n - 0.9); //1-0.9=0.1
//
        //float f = 1.0F;
//
        //System.out.println(0.1F * 3.0F); //1.0-0.9=0.1
//
        //System.out.println(number);


    }
}
